# RevitLinkGraphicsSettings Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkGraphicsSettings Constructor
RevitLinkGraphicsSettings Class See Also
---
Creates a new RevitLinkGraphicsSettings instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public RevitLinkGraphicsSettings()
```

Visual Basic
---
```text
Public Sub New
```

Visual C++
---
```text
public:
RevitLinkGraphicsSettings()
```

# See Also
RevitLinkGraphicsSettings Class
Autodesk.Revit.DB Namespace